In [1]:
"""Task 17 : python(class - 30/12/2020)(Task with Replace)"""
#Create a DataFrame and use replace function to replace the observations.

import numpy as np
import pandas as pd

In [3]:
#np arrays
name = ['A', 'B', 'C', 'D', 'E']
para1 =[10,11,13,12,14]
para2 =[2,3,5,7,9]
para3 =[2,4,8,16,32]
#creating dictionary
dict1 = {
    'Name':name,
    'Para1':para1,
    'Para2':para2,
    'Para3':para3
    }

#creating dataframe
df = pd.DataFrame(dict1)
df  # Main Observations & Data Frame

  Name  Para1  Para2  Para3
0    A     10      2      2
1    B     11      3      4
2    C     13      5      8
3    D     12      7     16
4    E     14      9     32

In [8]:
df.replace([10,3,2,8],np.nan) #Replace the values 10,3,2,8 with NaN

  Name  Para1  Para2  Para3
0    A    NaN    NaN    NaN
1    B   11.0    NaN    4.0
2    C   13.0    5.0    NaN
3    D   12.0    7.0   16.0
4    E   14.0    9.0   32.0

In [7]:
df["Para3"].replace(2,"yum") #Replace 2 in Para3 with a string

0    yum
1      4
2      8
3     16
4     32
Name: Para3, dtype: object

In [9]:
df.replace({10:9,3:'y'}) #Replace multiple values at the same time

  Name Para1 Para2 Para3
0    A     9     2     2
1    B    11     y     4
2    C    13     5     8
3    D    12     7    16
4    E    14     9    32